# # 로우, 컬럼 삭제

- 컬럼 삭제
    - del 키워드 + 컬럼 인덱싱
    - df.drop(col, axis=1)
    - df.drop(columns=col)
- 로우 삭제
    - df.drop(idx) : axis = 0 (기본값)

In [1]:
import pandas as pd
import numpy as np

In [2]:
sample = pd.DataFrame({'서울':[150.0, 180.0, 300.0, 0.0, 0.0, 10.0, 10.0],
'경기':[200.0, 240.0, 450.0, 0.0, 1.0, 20.0, 21.0],
'충청':[-10.0, 3.0, -13.0, 0.0, 2.0, 40.0, 42.0],
'경상':[10.0, 20.0, 30.0, 0.0, 3.0, 21.0, 24.0],
'전라':[5.0, 6.0, 7.0, 0.0, 4.0, 37.0, 41.0],
'제주':[1.0, 1.0, 1.0, 0.0, 5.0, 103.0, 108.0],
'부산':[5.0, 6.0, 7.0, 0.0, 6.0, 28.0, 34.0],
'수도권':[350.0, 420.0, 750.0, 0.0, 8.0, 30.0, 37.0],
'강원':[9.0, -99.0, np.NAN, 0.0, 8.0, 15.0, 23.0],
'test':[np.NAN, np.NAN, np.NAN, 0.0, 9.0, 0.0, 9.0]},
             index=[1990, 1992, 1993, 1994, 1995, 1996, 1997])

In [3]:
sample

         서울     경기    충청    경상    전라     제주    부산    수도권    강원  test
1990  150.0  200.0 -10.0  10.0   5.0    1.0   5.0  350.0   9.0   NaN
1992  180.0  240.0   3.0  20.0   6.0    1.0   6.0  420.0 -99.0   NaN
1993  300.0  450.0 -13.0  30.0   7.0    1.0   7.0  750.0   NaN   NaN
1994    0.0    0.0   0.0   0.0   0.0    0.0   0.0    0.0   0.0   0.0
1995    0.0    1.0   2.0   3.0   4.0    5.0   6.0    8.0   8.0   9.0
1996   10.0   20.0  40.0  21.0  37.0  103.0  28.0   30.0  15.0   0.0
1997   10.0   21.0  42.0  24.0  41.0  108.0  34.0   37.0  23.0   9.0

In [4]:
del sample['test']

In [5]:
sample

         서울     경기    충청    경상    전라     제주    부산    수도권    강원
1990  150.0  200.0 -10.0  10.0   5.0    1.0   5.0  350.0   9.0
1992  180.0  240.0   3.0  20.0   6.0    1.0   6.0  420.0 -99.0
1993  300.0  450.0 -13.0  30.0   7.0    1.0   7.0  750.0   NaN
1994    0.0    0.0   0.0   0.0   0.0    0.0   0.0    0.0   0.0
1995    0.0    1.0   2.0   3.0   4.0    5.0   6.0    8.0   8.0
1996   10.0   20.0  40.0  21.0  37.0  103.0  28.0   30.0  15.0
1997   10.0   21.0  42.0  24.0  41.0  108.0  34.0   37.0  23.0

In [8]:
sample.drop(columns='경상', inplace=True)

In [9]:
sample

         서울     경기    충청    전라     제주    부산    수도권    강원
1990  150.0  200.0 -10.0   5.0    1.0   5.0  350.0   9.0
1992  180.0  240.0   3.0   6.0    1.0   6.0  420.0 -99.0
1993  300.0  450.0 -13.0   7.0    1.0   7.0  750.0   NaN
1994    0.0    0.0   0.0   0.0    0.0   0.0    0.0   0.0
1995    0.0    1.0   2.0   4.0    5.0   6.0    8.0   8.0
1996   10.0   20.0  40.0  37.0  103.0  28.0   30.0  15.0
1997   10.0   21.0  42.0  41.0  108.0  34.0   37.0  23.0

In [10]:
sample.drop(columns='충청', inplace=True)

In [11]:
sample

         서울     경기    전라     제주    부산    수도권    강원
1990  150.0  200.0   5.0    1.0   5.0  350.0   9.0
1992  180.0  240.0   6.0    1.0   6.0  420.0 -99.0
1993  300.0  450.0   7.0    1.0   7.0  750.0   NaN
1994    0.0    0.0   0.0    0.0   0.0    0.0   0.0
1995    0.0    1.0   4.0    5.0   6.0    8.0   8.0
1996   10.0   20.0  37.0  103.0  28.0   30.0  15.0
1997   10.0   21.0  41.0  108.0  34.0   37.0  23.0

In [16]:
sample.drop(1995, inplace=True)

In [17]:
sample

         서울     경기    전라     제주    부산    수도권    강원
1990  150.0  200.0   5.0    1.0   5.0  350.0   9.0
1992  180.0  240.0   6.0    1.0   6.0  420.0 -99.0
1993  300.0  450.0   7.0    1.0   7.0  750.0   NaN
1994    0.0    0.0   0.0    0.0   0.0    0.0   0.0
1996   10.0   20.0  37.0  103.0  28.0   30.0  15.0
1997   10.0   21.0  41.0  108.0  34.0   37.0  23.0

In [18]:
sample.drop(columns=['제주','강원'], inplace=True)
sample

         서울     경기    전라    부산    수도권
1990  150.0  200.0   5.0   5.0  350.0
1992  180.0  240.0   6.0   6.0  420.0
1993  300.0  450.0   7.0   7.0  750.0
1994    0.0    0.0   0.0   0.0    0.0
1996   10.0   20.0  37.0  28.0   30.0
1997   10.0   21.0  41.0  34.0   37.0

In [19]:
sample.drop([1994, 1997], inplace=True)
sample

         서울     경기    전라    부산    수도권
1990  150.0  200.0   5.0   5.0  350.0
1992  180.0  240.0   6.0   6.0  420.0
1993  300.0  450.0   7.0   7.0  750.0
1996   10.0   20.0  37.0  28.0   30.0

In [20]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3), index=list('abc'), columns=['서울', '인천', '경기'])
df1

   서울  인천  경기
a   0   1   2
b   3   4   5
c   6   7   8

In [21]:
df2 = pd.DataFrame(np.arange(20).reshape(4, 5), index=list('abcd'), columns=['서울','경기','인천','세종','강원'])
df2

   서울  경기  인천  세종  강원
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19

In [22]:
pd.DataFrame(np.zeros(20).reshape(4,5), columns=list('abcde'))

     a    b    c    d    e
0  0.0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0  0.0